<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<title>Configuration du client email : Thunderbird</title>
</head>
<body BGCOLOR="#7271b2">
<center>
<table width="790" bgcolor="#ffffff" border="0" cellspacing="5">
 <tr>
  <td>
<center><H1>Configuration du client email Thunderbird.</H1></center>
<br><br>
<p><b>Information de base de notre compte d'exemple :</b></p>
<p>
Adresse email : "<b>mon.adresse@mondomaine.com</b>"<br>
Mot de passe&nbsp; : "<b>a1b2c</b>"<br>
Serveur IMAP&nbsp; : "<b>mail.mondomaine.com</b>"<br>
Serveur SMTP&nbsp; : "<b>mail.mondomaine.com</b>"<br>
</p>
<br>
<p><b>Configuration de Thunderbird :</b></p>
<p>Pour t&eacute;l&eacute;charger Mozilla-Thunderbird, vous pouvez aller sur <a target="_blank" href="http://www.mozilla-europe.org/fr/products/thunderbird/" title="T&eacute;l&eacute;charger Mozilla Thunderbird">http://www.mozilla-europe.org/fr/products/thunderbird/</a></p>
<br>
<p>Une fois Thunderbird install&eacute; et ex&eacute;cut&eacute;, une fen&ecirc;tre de configuration appara&icirc;t.<br>
Si vous utilisez d&eacute;j&agrave; Thunderbird, pour obtenir cette m&ecirc;me fen&ecirc;tre appuyez sur l'onglet "<b><u>F</u>ichier</b>", puis "<b>Nouv<u>e</u>au</b>", puis "<b>Com<u>p</u>te</b>".</p>
<p><img src="img/thunderbird.1.png" alt="" ></p>
<p>S&eacute;lectionnez si besoin "<b><u>N</u>e rien importer</b>", puis appuyez sur "<b><u>S</u>uivant</b>".</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.2.png" alt="" ></p>
<p>S&eacute;lectionnez "<b><u>C</u>ompte courrier &eacute;lectronique</b>", puis appuyez sur "<b><u>S</u>uivant</b>".</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.3.png" alt="" ></p>
<p>Lorsque l'on compose un email, l'adresse d'envoie se fait sous la forme : "<i>Nom &lt;adresse@email&gt;</i>".<br>
Ici la configuration de la partie "<b><u>V</u>otre nom :</b>" correspond &agrave; la valeure de "<i>Nom</i>" pour l'adresse d'exp&eacute;diteur "<i>Nom &lt;adresse@email&gt;</i>".<br>
Dans notre exemple, le destinataire recevra les emails avec pour provenance "<i>Mon nom &lt;mon.adresse@mondomaine.com&gt;</i>", son contenu n'a pas d'importance mais Thunderbird a besoin d'une configuration pour pouvoir continuer.<br><br>
La partie &agrave; d&eacute;finir pour "<b><u>A</u>dresse de courrier :</b>" correspond &agrave; l'adresse email que l'on d&eacute;sire utiliser.<br>
Dans notre exemple, l'adresse email &agrave; configurer est "<i>mon.adresse@mondomaine.com</i>".</p>
<p>Pour passer &agrave; l'&eacute;tape suivante, cliquez sur le bouton "<b><u>S</u>uivant</b>" situ&eacute; en bas &agrave; droite.</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.4.png" alt="" ></p>
<p>Le serveur de r&eacute;ception utilis&eacute; est un serveur IMAP, il faut donc s&eacute;lectionner "<b><u>I</u>MAP</b>" et lui indiquer son adresse dans le champ "<b><u>N</u>om du serveur :</b>".<br>
Dans notre exemple, le nom du serveur de r&eacute;ception est "<i>mail.mondomaine.com</i>".</p>
<p>Il faut aussi d&eacute;finir le nom du serveur d'envoi (SMTP), pour se faire, remplir le champ "<b>Nom du <u>s</u>erveur :</b>".<br>
Dans notre exemple, le nom du serveur d'envoi est "<i>mail.mondomaine.com</i>".</p>
<p>Pour passer &agrave; l'&eacute;tape suivante, cliquez sur le bouton "<b><u>S</u>uivant</b>" situ&eacute; en bas &agrave; droite.</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.5.png" alt="" ></p>
<p>Pour pouvoir se connecter sur le serveur de r&eacute;ception, il faut s'identifier avec le nom de l'adresse email.<br>
Pour se faire, il faut d&eacute;finir dans le champ "<b><u>N</u>om d'utilisateur entrant :</b>" le nom de l'adresse email authoris&eacute;.<br>
Dans notre exemple, l'utilisateur entrant authoris&eacute; est "<i>mon.adresse@mondomaine.com</i>".</p>
<p>Pour pouvoir se connecter sur le serveur d'envoi, il faut aussi s'identifier avec le nom de l'adresse email.<br>
Pour se faire, il faut d&eacute;finir dans le champ "<b>N<u>o</u>m d'utilisateur sortant :</b>" le nom de l'adresse email authoris&eacute;.<br>
Dans notre exemple, l'utilisateur sortant authoris&eacute; est "<i>mon.adresse@mondomaine.com</i>".<br>
Pour les personnes ayant d&eacute;j&agrave; configur&eacute; thunderbird, cette derni&egrave;re partie n'est pas modifiable, nous reviendrons dessus plus loin.</p>
<p>Pour passer &agrave; l'&eacute;tape suivante, cliquez sur le bouton "<b><u>S</u>uivant</b>" situ&eacute; en bas &agrave; droite.</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.6.png" alt="" ></p>
<p>Thunderbird permet de configurer plusieurs adresses emails afin de relever et d'envoyer des courriers &eacute;lectroniques.<br>
Pour rendre l'utilisation plus ais&eacute;e dans l'arboraissances des r&eacute;pertoires d'emails, il est conseill&eacute; d'utiliser le nom de l'adresse email pour le r&eacute;pertoire racine de compte.<br>
Pour se faire, il faut d&eacute;finir dans le champ "<b>Nom du <u>c</u>ompte :</b>" l'adresse email employ&eacute;.<br>
Dans notre exemple on nommera le r&eacute;pertoire racine de notre configuration "<i>mon.adresse@mondomaine.com</i>".</p>
<p>Pour passer &agrave; l'&eacute;tape suivante, cliquez sur le bouton "<b><u>S</u>uivant</b>" situ&eacute; en bas &agrave; droite.</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.7.png" alt="" ></p>
<p>Il s'agit du r&eacute;capitulatif de la configuration de l'adresse email.</p>
<p>Il faut maintenant affiner cette configuration afin de pouvoir la s&eacute;curiser.</p>
<p>Pour passer &agrave; l'&eacute;tape suivante, cliquez sur le bouton "<b>Terminer</b>" situ&eacute; en bas &agrave; droite.</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.8.png" alt="" ></p>
<p>Une fois la configuration de base termin&eacute;e, Thunderbird va essayer de se connecter au serveur de r&eacute;ception afin de relever le courrier.<br>
La connexion au serveur se fait &agrave; l'aide d'identifiants, compos&eacute;s du nom de l'adresse email (que l'on a d&eacute;fini tout &agrave; l'heure) et d'un mot de passe.<br>
En essayant de relever le courrier, Thunderbird demande alors le mot de passe &agrave; d&eacute;finir. Dans le champ pr&eacute;vu &agrave; cet effet, d&eacute;finissez la valeure du mot de passe n&eacute;cessaire. Dans notre exemple on mettra donc "<b>a1b2c</b>". Puis cochez la case "<b>Utiliser le gestionnaire de mots de passe pour retenir ce mot de passe.</b>" afin de ne plus avoir cette demande de mot de passe.</p>
<p>Cliquez sur le bouton "<b>OK</b>" situ&eacute; en bas &agrave; droite.</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.9.png" alt="" ></p>
<p>Il s'agit d'un rappel &agrave; propos de ma gestion des mots de passe.<p>
<p>Cliquez sur le bouton "<b>OK</b>" situ&eacute; en bas &agrave; droite.</p>
<br>
<p>Fen&ecirc;tre principale de Thunderbird :</p>
<p><img src="img/thunderbird.10.png" alt="" ></p>
<p>Pour configurer la connexion s&eacute;curis&eacute;e aux serveurs, il faut modifier la configuration du compte actuel.<br>
Pour se faire, cliquez sur l'onglet "<b>&Eacute;ditio<u>n</u></b>" situ&eacute; en haut &agrave; gauche de la fen&ecirc;tre principale de Thunderbird, puis d&eacute;roulez le menu et allez dans "<b>P<u>a</u>ram&egrave;tres des comptes...</b>" pour la version GNU/Linux. Pour les autres versions il s'agit de l'onglet "<b><u>O</u>utils</b>" puis "<b>Para<u>m</u>&egrave;tres des comptes...</b>".<br>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.11.png" alt="" ></p>
<p>Pour configurer l'acc&egrave;s au serveur d'envoi, il faut cliquer sur "<b>Serveur Sortant (SMTP)</b>" situ&eacute; tout en bas dans l'arborescence, &agrave; gauche de la fen&ecirc;tre. Puis selectionner "<b>mon.adresse@mondomaine.com - smtp.mondomaine.com</b>" et appuyer sur le bouton "<b><u>M</u>odifier</b>".</p>
<br>
<p>Une nouvelle fen&ecirc;tre appara&icirc;t :</p>
<p><img src="img/thunderbird.12.png" alt="" ></p>
<p>Selectionnez soit "<b><u>T</u>LS</b>" qui permet de se connecter sur le port classique <b>25</b>, soit sur "<b>SS<u>L</u></b>" qui permet de se connecter sur le port s&eacute;curis&eacute; <b>465</b>, puis validez en appuyant sur le bouton "<b>OK</b>".</p>
<br>
<p>Il ne reste plus qu'&agrave; configurer l'acc&egrave;s au serveur de r&eacute;ception.<br>
Allez dans "<b>Param&egrave;tres serveur</b>" se situant dans l'arborescence sous "mon.adresse@mondomaine.com", &agrave; gauche de la fen&ecirc;tre.</p>
<br>
<p><img src="img/thunderbird.13.png" alt="" ></p>
<p>M&ecirc;me cas que pour le serveur d'envoi, deux choix sont possibles pour s&eacute;curiser la connexion.<br>
Dans la partie "<b>Param&egrave;tres de s&eacute;curit&eacute;</b>", soit s&eacute;lectionner "<b>T<u>L</u>S</b>" pour utiliser le port classique "<b>143</b>" soit s&eacute;lectionner "<b><u>S</u>SL</b>" pour utiliser le port "<b>993</b>" exclusivement destinn&eacute; aux connexions s&eacute;curis&eacute;e.</p>
<p>Pour en finir avec ces configurations basiques, cliquez sur le bouton "<b>OK</b>" situ&eacute; en bas &agrave; droite.</p>
<br><br>
<p>Thunderbird est fin pr&ecirc;t, les connexions seront crypt&eacute;es.</p>
<br><br><br>
<center><a href="index.html"><b>Retour</b></a></center>
<br><br><br>
  </td>
 </tr>
</table>
</center>
</body>
</html>

